from google import genai
from google.genai import types
import time


prompt = """
    请作为股票专家，基于下面给出的2026.1.9和2026.1.12的集合竞价封单额数据进行对比，回答下面的两个问题，一个问题一个问题回答，并分段。
1. 对比两天的整体封单情况：1亿以上封单的家数和封单额大小变化，12号对比9号的竞价结果，资金态度是做多还是做空，先给出结论再用表格方式简洁进行简洁分析
2. 严格筛选出“特别超出预期”的股票。
“特别超出预期”的定义（必须同时满足以下任一条件）：
突增型：该股在前一日封单额为零或极低（例如<5亿），而在当日封单额大幅跃升至高位（例如>10亿或进入当日TOP 5）。
跃升型：该股在前一日未上榜或排名靠后（例如>第15名），而在当日排名大幅提升至前列（例如进入当日TOP 5）。
排除项：
封单额和排名均保持稳定或仅小幅波动的股票（即使金额巨大）。
封单额或排名显著下滑的股票。
封单额小于3亿以下
输出要求：
仅列出符合上述“特别超出预期”标准的股票。
输出格式为表格，包含列：股票代码、股票名称、上一次封单额、最新封单额。
---
2026.1.9
代码,名称,封单额
002931,锋龙股份,44.8
600783,鲁信创投,23.6
600477,杭萧钢构,21.5
002342,巨力索具,8.67
000987,越秀资本,6.76
601106,中国一重,2.54
002431,棕榈股份,2.37
603017,中衡设计,2.25
600869,远东股份,1.74
603938,三孚股份,1.04
---
2026.1.12
序号,代码,名称,封单额
1,002131,利欧股份,38.6
2,002931,锋龙股份,37.1
3,002044,美年健康,20.3
4,603598,引力传媒,16.8
5,600477,杭萧钢构,16.4
6,002792,通宇通讯,13.5
7,600776,东方通信,12.2
8,000681,视觉中国,8.95
9,600783,鲁信创投,7.44
10,603000,人民网,5.59
11,002774,快意电梯,5.31
12,002969,嘉美包装,4.41
13,003007,直真科技,3.17
14,603496,恒为科技,3.11
15,002342,巨力索具,3.01
16,300986,志特新材,2.84
17,600676,交运股份,1.92
18,603305,旭升集团,1.43
19,600880,博瑞传播,1.35
20,600637,东方明珠,1.31
    """

if __name__ == '__main__':
    client = genai.Client(
        api_key="sk-Ne4NGGO9TdzBbB84X0oBBFXP8hVB2nHyYHxx3ETsaDKH4p7h",
        vertexai=True, # 可选，优先使用vertexai协议访问，稳定性更高
        http_options={
            "base_url": "https://api.openai-proxy.org/google"
        },
    )

    start_time = time.localtime()
    response = client.models.generate_content(
        model='gemini-3-flash-preview',
        contents= prompt,
        config=types.GenerateContentConfig()
    )
    end_time = time.localtime()
    print(response.text)
    print(f'耗时（秒）：{time.mktime(end_time) - time.mktime(start_time)}')
